{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 1], [60, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 1], [68, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_3_1", 
      "inputs": [[54, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 1], [84, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_1_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_1_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_1_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_4_1", 
      "inputs": [[101, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_2_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_2_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_2_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 1], [147, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_4_2", 
      "inputs": [[125, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 1], [155, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 1], [163, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_4_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0], [177, 0, 1], [178, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_4_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_4_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0], [184, 0, 0], [185, 0, 1], [186, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_4_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_4_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 1], [194, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_4_4", 
      "inputs": [[172, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_5_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_5_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0], [201, 0, 1], [202, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_5_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_5_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_dwise_bn_gamma", 
