{
  "nodes": [
    {
      "op": "null", 
      "name": "label1", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "lvl1 _label_split", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "75", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 1], [8, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 1], [78, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_3_1", 
      "inputs": [[56, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_1_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_1_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_1_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_4_1", 
      "inputs": [[103, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_2_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 1], [133, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_2_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_2_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 1], [149, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_4_2", 
      "inputs": [[127, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 1], [157, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_4_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0], [179, 0, 1], [180, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_4_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4_dwise", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_dwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_4_dwise_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0], [187, 0, 1], [188, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_4_dwise", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4_linear", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_linear_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_4_linear_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0], [194, 0, 0], [195, 0, 1], [196, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block_4_4", 
      "inputs": [[174, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_5_expand", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_5_expand_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_5_expand_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [202, 0, 0], [203, 0, 1], [204, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_5_expand", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_5_dwise_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "num_group": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_5_dwise", 
      "attrs": {
